{
  "name": "Julie Stetz",
  "age": null,
  "location": "New York City Metropolitan Area",
  "occupation": "Creative + Marketing Operations Leader",
  "interests": [
    "Penn State Alumni Association – New York City Chapter",
    "22to0",
    "Visual Merchandising Across the Globe",
    "Fashion Marketing & Digital Media Group (FMG)",
    "Luxury & Lifestyle Professionals"
  ],
  "skills": [
    "Marketing Operations",
    "Creative Leadership",
    "Brand Development",
    "Creative Project Management",
    "Digital Marketing Strategies",
    "Data-informed Solutions",
    "Cross-functional Team Leadership",
    "Growth Strategy",
    "Brand Initiatives",
    "Innovative Marketing Strategies",
    "Process Optimization"
  ],
  "education": [
    "Bachelor of Science in Marketing & Communications, Penn State University (2006 – 2010)"
  ],
  "experience": [
    "Marketing Director at Luxury Brand Marketing, Inc. (March 2020 – Present | New York, NY): Leads marketing strategy and brand development for high-end retail and fashion clients; Manages creative teams to produce compelling content, digital campaigns, and experiential marketing initiatives; Implements data-driven marketing approaches to enhance customer engagement and ROI.",
    "Senior Marketing Manager at Fashion Retail Group (June 2015 – March 2020 | New York, NY): Developed and executed multi-channel marketing campaigns that increased brand visibility and customer loyalty; Managed relationships with key industry influencers and media outlets; Oversaw digital transformation initiatives, optimizing e-commerce and social media strategies.",
    "Creative Operations Manager at Retail Innovations LLC (January 2010 – June 2015 | New York, NY): Led creative project management for major retail brand launches; Coordinated cross-functional teams, ensuring seamless execution of marketing and branding initiatives; Streamlined workflow processes, reducing time-to-market for new campaigns."
  ],
  "bio": "Julie Stetz is a results-driven marketing operations and creative leader with a track record of delivering strategic, data-informed solutions. She has a deep understanding of brand development, creative project management, and digital marketing strategies, enabling her to lead cross-functional teams and drive measurable growth for organizations. Her expertise spans the luxury, fashion, and retail industries, where she has successfully overseen brand initiatives, implemented innovative marketing strategies, and optimized processes to enhance efficiency and effectiveness."
}