{
  "name": "Ali Parker",
  "title": "Co-Founder at The Broad Collective | Experiential and Brand Marketing, Strategy, and Production",
  "location": "Atlanta, Georgia, United States",
  "key_skills": [
    "Event Management",
    "Event Planning",
    "Sports Marketing"
  ],
  "contact": {
    "linkedin": "https://www.linkedin.com/in/ali-parker-79191427",
    "email": null,
    "company_website": "https://www.alilouiseparker.com"
  },
  "certificates": [
    {
      "name": "Launch Event Coordinator Exam",
      "issuer": "",
      "date_earned": null,
      "expiry_date": null,
      "credential_id": null,
      "status": "In Progress"
    },
    {
      "name": "Wedding Assistant Exam",
      "issuer": "",
      "date_earned": null,
      "expiry_date": null,
      "credential_id": null,
      "status": "In Progress"
    },
    {
      "name": "Launch Event Assistant Exam",
      "issuer": "",
      "date_earned": null,
      "expiry_date": null,
      "credential_id": null,
      "status": "In Progress"
    }
  ],
  "experience": [
    {
      "company": "The Broad Collective",
      "title": "Co-Founder | Experiential and Brand Marketing, Strategy, and Production",
      "duration": {
        "start_date": "2018-01",
        "end_date": "Present",
        "date_range": "7 years 2 months"
      },
      "location": "Austin, Texas, United States",
      "description": [
        "Built an agency from the ground up by optimizing existing relationships, creating new partnerships and 10+ years of industry knowledge which grew revenue over 60% year over year (pre COVID-19)."
      ],
      "company_url": null
    },
    {
      "company": "Freelance",
      "title": "Experiential and Creative Producer",
      "duration": {
        "start_date": "2017-04",
        "end_date": "2017-12",
        "date_range": "9 months"
      },
      "location": "Greater Chicago, Illinois, United States",
      "description": [
        "Hired by agencies and brands to conceptualize and produce experiential marketing campaigns that increased brand awareness among key demographics.",
        "Headed a team of creative freelancers and collaborated with clients to produce three to four projects simultaneously.",
        "Demonstrated professionalism and knowledge by repeatedly being recruited by the same clients."
      ],
      "company_url": null
    },
    {
      "company": "BeCore",
      "title": "Director of Production",
      "duration": {
        "start_date": "2016-01",
        "end_date": "2017-03",
        "date_range": "1 year 3 months"
      },
      "location": "Greater Los Angeles, California, United States",
      "description": [
        "Managed 12 key accounts and a team of 10+ at an Experiential Marketing agency based in Los Angeles.",
        "Member of the executive team that directly influenced company strategy and overall goals by researching industry standards and practices and ensuring we met or exceeded in all areas.",
        "Advocated for updated company benefits to improve employee retention and burnout which led to retaining producers for 2+ years in a high-turnover industry.",
        "Orchestrated weekly meetings to ensure cross-functional collaboration with creative and business development teams as well as forecasting future revenue and growth.",
        "Represented the executive team onsite at events to oversee production team and seek out new business opportunities."
      ],
      "company_url": null
    },
    {
      "company": "BeCore",
      "title": "Account Director",
      "duration": {
        "start_date": "2014-10",
        "end_date": "2015-12",
        "date_range": "1 year 3 months"
      },
      "location": null,
      "description": [
        "Oversaw accounts and directed internal production and creative teams to align with the brand teams for Mark Anthony Brands and Teva.",
        "Grew accounts revenue by building relationships with clients, seeking out new opportunities with different brands under the umbrella and hitting KPIs on projects which led to increased budgets year over year.",
        "Increased average profit margin on projects by 5%."
      ],
      "company_url": null
    },
    {
      "company": "BeCore",
      "title": "Senior Producer",
      "duration": {
        "start_date": "2013-01",
        "end_date": "2014-09",
        "date_range": "1 year 9 months"
      },
      "location": "Greater Los Angeles, California, United States",
      "description": [
        "Strategized and executed 30+ events for Red Bull, Nike, Muscle Milk, NASCAR, DC and other key brands including the Red Bull Activation at US Open of Surfing, Energy Station at Red Bull MotoGP, Energy Station at Red Bull X Fighters, Nike NTC Week.",
        "Trained a team of 5+ Assistant Producers and Project Coordinators.",
        "Continuously met and exceeded client expectations and hit all KPIs specific to the project which led to year over year repeat projects, client retention and account growth."
      ],
      "company_url": null
    },
    {
      "company": "Red Frog Events",
      "title": "Event Director | Warrior Dash",
      "duration": {
        "start_date": "2010-05",
        "end_date": "2012-10",
        "date_range": "2 years 6 months"
      },
      "location": null,
      "description": [
        "Planned and executed over 25 domestic and international events within the active entertainment industry and created all pre-event reports, budgets and data to ensure accurate onsite execution.",
        "Developed an event strategy and RFP used to present to local governments both domestically and in Australia for approval on future event locations.",
        "Built relationships with key vendors that translated into over $100K in savings per year.",
        "Spearheaded team to run first P&L & set of analytics on flagship event to understand overall profit margin and made recommendations to CEOs for efficiencies."
      ],
      "company_url": null
    },
    {
      "company": "Red Frog Events",
      "title": "Production Manager | Firefly Music Festival",
      "duration": {
        "start_date": "2010-01",
        "end_date": "2010-05",
        "date_range": "5 months"
      },
      "location": "Chicago, Illinois, United States",
      "description": [
        "Created the on-site logistics and operations plan and led the on-site BOH production team for a successful first year, three-day festival with attendance of 30K/day and headlined by The Black Keys, John Legend, Jack White and The Killers.",
        "Researched and vetted key vendors for staging and production leading to a multi-contract agreement with selected vendors.",
        "Established roles and responsibilities for on-site BOH production team.",
        "Core member of initial planning team responsible for site visits, permitting and operations."
      ],
      "company_url": null
    },
    {
      "company": "Mad Eagle: A Unique Boutique",
      "title": "Manager / Visual Merchandiser",
      "duration": {
        "start_date": "2005-11",
        "end_date": "2009-12",
        "date_range": "4 years 2 months"
      },
      "location": null,
      "description": [
        "Assisted owner in discovering new lines and ordering and processing shipments.",
        "Designed window and in-store displays.",
        "Hosted private in-store parties for select clientele.",
        "Styled outfits for magazine shoots as well as select clients.",
        "Created relationships with loyal clients and acted as a personal shopper to many.",
        "Communicated the uniqueness of many of our brands as well as created advertisements to inform current and future clientele of sales and promotions.",
        "Assisted brides in designing and selecting jewelry for their weddings."
      ],
      "company_url": null
    }
  ],
  "normalization_notes": "Standardized company names, job titles, and date formats. Specified location names for clarity."
}