{
  "name": "Elyse Inferrera",
  "age": null,
  "location": "Rancho Palos Verdes, California, United States",
  "gender": null,
  "company": "United Football League (UFL)",
  "companyType": "Sports and Entertainment",
  "companySize": "N/A",
  "industry": "Sports and Entertainment",
  "occupation": "UFL Game Day Entertainment and Fan Experience Consultant",
  "interests": [],
  "skills": [
    "Accounting",
    "Event Planning",
    "Event Management",
    "Time Management",
    "Public Relations"
  ],
  "education": [
    "Bachelor's degree in Business Management and Sports Management, Marymount California University (2014 - 2017)"
  ],
  "experience": [
    {
      "company": "United Football League (UFL)",
      "position": "UFL Game Day Entertainment and Fan Experience Consultant",
      "startDate": "October 2022",
      "endDate": "Present",
      "duration": "2 years 5 months",
      "location": "N/A",
      "description": "Organize, advance, and execute game days for all 8 markets in the league and produce special events beyond normal game operations: Draft, Town Halls, playoffs, and Championship. Create all game scripts in ShoFlo and create/deliver time sheets to Broadcast, Football Ops, and league staff. Oversee the game day, operations crew, and stage managers, including scheduling, event confirmations, and payroll. Manage all sponsorship inventory and ensure accurate execution and all markets relating to videos, signage, and graphics."
    },
    {
      "company": "Los Angeles Football Club (LAFC)",
      "position": "Stage Manager",
      "startDate": "April 2018",
      "endDate": "Present",
      "duration": "6 years 11 months",
      "location": "Greater Los Angeles Area",
      "description": "Organize and facilitate in-stadium production and events. Work directly with show producer to ensure pre-game and half-time events are properly executed.\n\nOutside LAFC Events:\n- MLS All Star Game 2021\n- CONCACAF Championship 2023\n- Copa Angelina 2022 & 2023\n- Leagues Cup 2023"
    },
    {
      "company": "ARTEMIS EVENTS",
      "position": "Associate Producer",
      "startDate": "June 2016",
      "endDate": "Present",
      "duration": "8 years 9 months",
      "location": "Greater Los Angeles Area",
      "description": "Organize, advance and execute various events including overseeing load in, event day, and load out. Develop budgets and account for all expenses involved with each production. Create Production Timelines, manage vendor relationships, and act as liaison between client and building operations crews. Strategically plan overall event constructs including multimedia elements, guest pathways and experience, timelines, and execution goals to ensure the fundamental success of events in conjunction with client goals.\n\nNotable Events:\n- Lakers Events\n- Drone Racing League\n- BETX"
    },
    {
      "company": "Joe Lewis Company (JLC)",
      "position": "Production Specialist",
      "startDate": "January 2022",
      "endDate": "Present",
      "duration": "3 years 2 months",
      "location": "Los Angeles, California, United States",
      "description": "Produce and assist with various events, including Special Olympics World Games 2023, Hollywood movie premieres, billboards, music events, award shows, red carpet events, unified cup, NFL parties, award show after parties, and more."
    },
    {
      "company": "Angel City Football Club",
      "position": "Stage Manager",
      "startDate": "April 2022",
      "endDate": "October 2022",
      "duration": "7 months",
      "location": "N/A",
      "description": "Organize and facilitate all in-stadium production and events related to Angel City football games. Manage pregame celebrations, halftime shows, activations, post-game celebrations, and sponsorship activations. Collaborate directly with the Show Caller to ensure all game elements are properly executed and league rules are followed in the stadium."
    },
    {
      "company": "Entertainment Industry Response (EIR)",
      "position": "Covid Compliance Officer",
      "startDate": "August 2020",
      "endDate": "May 2022",
      "duration": "1 year 10 months",
      "location": "Los Angeles, California, United States",
      "description": "Managed COVID-19 compliance protocols for events and productions, ensuring safety measures were met and maintained."
    },
    {
      "company": "KCD",
      "position": "Producer - Gucci Space",
      "startDate": "February 2022",
      "endDate": "March 2022",
      "duration": "2 months",
      "location": "United States",
      "description": "Collaborated with Gucci Special Events and Client Advisor teams to create unique Gucci Experiences in Los Angeles and Dallas. Transformed venues into “Gucci Spaces” generating over $14 million in sales. Managed vendors and assisted with budget management alongside the Gucci finance team."
    },
    {
      "company": "KCD",
      "position": "Production Manager - LOUIS VUITTON MENS FASHION SHOW 2021",
      "startDate": "November 2021",
      "endDate": "December 2021",
      "duration": "2 months",
      "location": "Miami, Florida, United States",
      "description": "Collaborated with senior producers and the Artistic Director to execute production needs. Created and maintained production schedules, coordinated with vendors, distributed production schedules and daily call sheets, and supervised production assistants."
    },
    {
      "company": "Los Angeles Kings",
      "position": "Supervisor",
      "startDate": "November 2016",
      "endDate": "March 2020",
      "duration": "3 years 5 months",
      "location": "Greater Los Angeles Area",
      "description": "- Organized and facilitated in-arena production and events, acting as a liaison between STAPLES Center and the LA Kings.\n- Produced and called all games, ensuring promotions were accurately executed.\n- Directed on-ice activities and ceremonies.\n- Wrote game scripts in ShoFlo and managed timing sheets for the NHL.\n- Oversaw GameDay Operations Crew and Stage Managers, including scheduling and event confirmations.\n- Managed in-game sponsorship inventory.\n- Stage managed special events beyond normal game operations, such as Bob Miller’s retirement ceremony, Festival, and Paint the Ice.\n- Set up fan engagement activations like Fan Fests and Season Ticket Member Events.\n- Managed Events Department inventory, including props, PA Systems, and photo activations."
    },
    {
      "company": "Los Angeles Chargers",
      "position": "Stage Manager and Production Coordinator",
      "startDate": "December 2017",
      "endDate": "December 2019",
      "duration": "2 years 1 month",
      "location": "Greater Los Angeles Area",
      "description": "- Managed vendors in fan-facing areas.\n- Coordinated special game appearances of Charger Girls and the Thunderbolts on the field.\n- Produced Christmas parties and Training Camp productions."
    },
    {
      "company": "All Access Staging & Production",
      "position": "Soft Good Department Manager and Inventory Tech",
      "startDate": "June 2015",
      "endDate": "April 2018",
      "duration": "2 years 11 months",
      "location": "Greater Los Angeles Area",
      "description": "- Managed all aspects of the Soft Goods Inventory.\n- Prepared and received rental orders for various entertainment industry jobs.\n- Tracked rental inventory, including missing or sold items.\n- Facilitated orders and requests between clients, sales representatives, and manufacturers.\n- Manufactured soft goods using an industrial sewing machine."
    },
    {
      "company": "Freelance",
      "position": "Special Projects - Various",
      "startDate": "June 2016",
      "endDate": "June 2016",
      "duration": "1 month",
      "location": "N/A",
      "description": "- Special Olympics World Game 2023 - Berlin: Served as a producer, scriptwriter, stage manager, and production manager for various events and parties, including Golisano Awards, Founders Reception, Round Table, and Opening and Closing ceremonies.\n- Lakers Special Events: Served as Associate Producer for events like Kobe Bryant’s statue unveiling, Elgin Baylor statue unveiling, Kobe’s Jersey Retirement, and Lakers Friends and Family Holiday Party.\n- BETX Experience - Production Coordinator (June 2016, 2017, 2018): Assisted with event coordination, managed load in and strike, liaised between BET, AEG, and Los Angeles Convention Center, managed vendor and talent relationships, and oversaw guest experience aspects.\n- NBA ALL STAR GAME 2018: Organized aspects with Turner Broadcasting's live events team, managed artist green rooms, assisted with talent movement, and managed production element installations related to TBN spaces."
    }
  ],
  "bio": "Experienced Game Entertainment Manager and Producer with a demonstrated history of working in the Sports and Entertainment Industry. Skilled in event planning, time management, event management, and Public Relations. Strong professional with a Bachelor's degree focused in Business Management and Sports Management from Marymount California University."
}