{
  "name": "Caren Read",
  "age": null,
  "location": "Lakeland, Florida, United States",
  "gender": "Female",
  "company": "Publix Super Markets",
  "companyType": "Retail/Supermarket",
  "companySize": "200,000+ employees",
  "industry": "Retail and Supermarket",
  "occupation": "Corporate Marketing Communications Manager",
  "interests": [],
  "skills": [
    "Brand Building and Integration",
    "Project Management",
    "Marketing Strategy/Strategic Planning",
    "Sponsorship Negotiations",
    "Special Event Management",
    "Digital/Social Media",
    "Media Planning and Analysis",
    "Corporate Communications/Spokesperson",
    "Market Activation",
    "Market Research/Competitive Analysis",
    "Multi-Unit Franchise Management"
  ],
  "education": [
    "University of Florida - Graduate Studies in Advertising",
    "Florida Southern College - BA, Marketing/International Management"
  ],
  "experience": [
    {
      "company": "Publix Super Markets",
      "position": "Corporate Marketing Communications Manager",
      "startDate": "August 2021",
      "endDate": "Present",
      "location": "Lakeland, Florida, United States",
      "description": "Develop and direct marketing communication campaigns to leverage corporate and multi-divisional strategies. Write marketing strategy briefs for customer-directed campaigns. Lead channel execution of strategic corporate marketing campaigns. Manage corporate and multi-divisional marketing sponsorship programs."
    },
    {
      "company": "Publix Super Markets",
      "position": "Regional Marketing Manager",
      "startDate": "May 2019",
      "endDate": "July 2021",
      "location": "Lakeland, Florida Area",
      "description": "Created, managed, and executed Title Sponsorships and Promotional Activities, including the NFL/Tampa Bay Buccaneers Pewter Partnership, for the Lakeland Division – 300+ stores. Provided strategic oversight for all marketing activities. Analyzed marketing research data, market share, and sales trends to increase sales. Stewarded a multi-million-dollar marketing budget for a billion-dollar region. Executed Grand Opening and Competitive Intrusion plans. Introduced a new brand concept into marketplace."
    },
    {
      "company": "Soccer Shots Franchising",
      "position": "Vice President of Marketing and Franchise Development",
      "startDate": "2018",
      "endDate": "2018",
      "location": "Harrisburg, Pennsylvania",
      "description": "Reported to COO, served on Leadership Team and National Convention Committee. Contributed to annual strategic planning, set and managed annual department budgets. Directed system-wide internal communications. Created and managed execution of marketing plans to address national branding and increase YOY local enrollments in over 200 markets throughout the US and Canada. Provided leadership to Franchise Sales team to identify, attract and approve candidates for franchise sales growth. Protected the Soccer Shots brand by ensuring effective representation in all marketing and communication materials."
    },
    {
      "company": "FOCUS Brands",
      "position": "National Director of Marketing - McAlister's Deli",
      "startDate": "2016",
      "endDate": "2017",
      "location": "Greater Atlanta Area",
      "description": "Provided direction and leadership for Field Marketing Team overseeing 400+ restaurants. Ensured effective communication between franchisees, field teams, agencies and corporate. Developed and implemented marketing programs and processes that contributed to sales growth and EBITDA goals. Managed growth of co-op formation. Created materials and communication platform for national cause marketing efforts. Served as leadership team member and consultant to Franchise Advisory Committee. Ensured that the franchisees were meeting the requirements for advertising spend by assessing and hiring an advertising agency to handle the local market media and advertising campaigns, ultimately driving sales and guest count across 70+ markets. Turned around the team performance by hiring and developing a strong field marketing team. Created a grand opening manual for new restaurants to provide a proven and scalable roadmap for building a profitable operation."
    },
    {
      "company": "Domino's Pizza",
      "position": "Area Leader - Field Marketing, Southeast Region",
      "startDate": "2014",
      "endDate": "2015",
      "location": "Greater Nashville Area, TN",
      "description": "Developed and implemented DMA level plans. Primary liaison and information source for all marketing programs for franchisees, operations, and company leadership. Served as local market spokesperson and community representative. Consulted with franchisees on local-level marketing plans that drove performance and met EBITDA goals."
    },
    {
      "company": "Dunkin' Brands",
      "position": "Field Marketing Manager - Baskin-Robbins, East Region",
      "startDate": "2013",
      "endDate": "2014",
      "location": "Greater Atlanta Area",
      "description": "Liaison between company and franchisees for all marketing initiatives. Created strong relationships between franchisees and corporate management. Oversaw Grand Opening plans/activities. Coached franchisees on community involvement. Created and communicated marketing programs to franchisees persuading them to buy into programs and increase their advertising spend. Strengthened relationships between the company and the franchisees by partnering with Brand Team to develop/design POP and LSM elements all of which led to significant sales growth."
    },
    {
      "company": "TGI Fridays",
      "position": "Marketing Manager - Southeast and West Regions",
      "startDate": "2010",
      "endDate": "2013",
      "location": "Greater Atlanta Area",
      "description": "Covered a territory of 30 Designated Market Areas (DMA’s), representing 135 Restaurants. Directed implementation of local store marketing Beer, Wine, and Spirit programs. Specialized in Sports and Holiday focused promotions. Consulted with Senior Management regarding media recommendations and agency management. Planned marketing activities with Franchisees and Corporate Directors of Operations. Analyzed marketing results for Senior Management. Supervised local Marketing Coordinator. Developed custom beverage promotions tied to special events that increased beverage sales by 5% YOY. Created local marketing plans that led to 5% - 7% YOY restaurant sales increases."
    },
    {
      "company": "Papa John's",
      "position": "Regional Marketing Director - Southeast",
      "startDate": "2000",
      "endDate": "2010",
      "location": "Greater Atlanta Area",
      "description": "Oversaw a territory of 42 DMA’s with 709 Restaurants. Developed and directed communication of national and local programs to franchisees, corporate operation teams. Provided marketing and general business leadership to fifteen co-ops and thirty-seven franchise markets. Led local activation of NASCAR, NFL, NBA, MLB and NHL programs. Assisted with development and activation of the annual PapaJohns.com Bowl in conjunction with ESPN. Created the One Club Golf World Championship Tournament – A Guinness World Record Event presented by Tournament Golf USA, Inc. Worked with Company Founder and PR department to optimize execution of “Papa’s in The House” Campaign, which won a Cannes Gold Lion Award in 2010. Authored On-line Marketing Guide. Supervised four local market managers. Led and challenged nine field agency teams - totaling $17 million in media budgets - to maximize buying efficiencies and added-value opportunities. Grew YOY sales 4% - 6%. Increased YOY online sales 15%."
    },
    {
      "company": "Carat",
      "position": "National Account Supervisor - Church's Chicken",
      "startDate": "1999",
      "endDate": "2000",
      "location": "Greater Atlanta Area",
      "description": "Oversaw 1,100 Restaurants. Supervised account/media buying start-up function. Hired, trained and led team of eight account executives, located in two field offices; managed $22 million budget; provided strategic guidance/expertise; initiated programs and developed systems; implemented marketing plans; analyzed sales reports; coordinated communication to regional office staff, restaurant owners, restaurants, and agency personnel. Participated in new business development."
    }
  ],
  "bio": "Innovative and strategic marketer with proven leadership skills leading to elevated brand awareness, improved brand loyalty and increased sales. Brand Ambassador known for an ability to develop strategic partnerships that lead to trusted partner status. Broad-based experience in both client-side and agency roles. Deep knowledge of marketing analytics and consumer behavior resulting in more targeted campaigns, effective use of marketing budgets and improved ROI. Servant leader committed to employee development, coaching, mentoring and team success."
}