{
  "name": "Elyse Inferrera",
  "title": "Event Producer | Game Presentation | Sports Entertainment | Live Event Entertainment",
  "location": "Rancho Palos Verdes, California, United States",
  "key_skills": [
    "Accounting",
    "Event Planning",
    "Event Management",
    "Public Relations",
    "Time Management"
  ],
  "contact": {
    "linkedin": "https://www.linkedin.com/in/elyse-inferrera-89b836149",
    "email": null,
    "company_website": null
  },
  "certificates": [],
  "experience": [
    {
      "company": "United Football League (UFL)",
      "title": "UFL Game Day Entertainment and Fan Experience Consultant",
      "duration": {
        "start_date": "Oct 2022",
        "end_date": "Present",
        "date_range": "2 years 5 months"
      },
      "location": null,
      "description": [
        "Organize, advance, and execute game days for all 8 markets in the league and produce special events beyond normal game operations: Draft, Town Halls, playoffs, and Championship.",
        "Create all game scripts in ShoFlo and create/deliver time sheets to Broadcast, Football Ops, and league staff.",
        "Oversee the game day operations crew and stage managers, including scheduling, event confirmations, and payroll.",
        "Manage all sponsorship inventory and ensure accurate execution and all markets relating to videos, signage, and graphics."
      ],
      "company_url": null
    },
    {
      "company": "Los Angeles Football Club (LAFC)",
      "title": "Stage Manager",
      "duration": {
        "start_date": "Apr 2018",
        "end_date": "Present",
        "date_range": "6 years 11 months"
      },
      "location": "Greater Los Angeles Area",
      "description": [
        "Organize and facilitate in-stadium production and events.",
        "Work directly with show producer to ensure pre-game and half-time events are properly executed."
      ],
      "company_url": null
    },
    {
      "company": "ARTEMIS EVENTS",
      "title": "Associate Producer",
      "duration": {
        "start_date": "Jun 2016",
        "end_date": "Present",
        "date_range": "8 years 9 months"
      },
      "location": "Greater Los Angeles Area",
      "description": [
        "Organize, advance and execute various events including overseeing load in, event day, and load out.",
        "Develop budgets and account for all expenses involved with each production.",
        "Create Production Timelines/manage vendor relationships/Liaison between client, building operations crews.",
        "Strategic planning of overall event constructs including but not limited to use of multi media elements, guest pathways and experience, timelines and execution goals, ensure fundamental success of event in conjunction with client goals."
      ],
      "company_url": null
    },
    {
      "company": "Joe Lewis Company (JLC)",
      "title": "Production Specialist",
      "duration": {
        "start_date": "Jan 2022",
        "end_date": "Present",
        "date_range": "3 years 2 months"
      },
      "location": "Los Angeles, California, United States",
      "description": [
        "Produce and assist with various events, including but not limited to Special Olympics world games 2023, Hollywood, movie, premieres, billboard, music, award, red carpet, unified cup, Special Olympics, NFL parties, award show after parties, etc."
      ],
      "company_url": null
    },
    {
      "company": "Angel City Football Club",
      "title": "Stage Manager",
      "duration": {
        "start_date": "Apr 2022",
        "end_date": "Oct 2022",
        "date_range": "7 months"
      },
      "location": null,
      "description": [
        "Organize and facilitate all in Stadium production and events related to Angel city football games.",
        "Pregame celebrations, halftime, activations, post game celebrations, and sponsorship activations.",
        "Worked directly with the Show Caller to ensure all game elements were properly executed, and that the league rules were followed in Stadium."
      ],
      "company_url": null
    },
    {
      "company": "Entertainment Industry Response (EIR)",
      "title": "Covid Compliance Officer",
      "duration": {
        "start_date": "Aug 2020",
        "end_date": "May 2022",
        "date_range": "1 year 10 months"
      },
      "location": "Los Angeles, California, United States",
      "description": [],
      "company_url": null
    },
    {
      "company": "KCD",
      "title": "Producer - Gucci Space",
      "duration": {
        "start_date": "Feb 2022",
        "end_date": "Mar 2022",
        "date_range": "2 months"
      },
      "location": "United States",
      "description": [
        "Worked directly with the Gucci Special Events and Client Advisor teams to create a unique and one of a kind Gucci Experience in Los Angeles and Dallas.",
        "Transformed an empty warehouse in the fashion district of LA and a 20,000 square-foot home in Preston Hollow into a ‘Gucci Space’ that generated over $14 million in sales.",
        "Arranged and managed vendors at both locations to bring to life this exclusive activation that embodied the Gucci brand.",
        "Assisted with management of budget and worked with the Gucci finance team on getting vendors onboarded."
      ],
      "company_url": null
    },
    {
      "company": "KCD",
      "title": "Production Manager - LOUIS VUITTON MENS FASHION SHOW 2021",
      "duration": {
        "start_date": "Nov 2021",
        "end_date": "Dec 2021",
        "date_range": "2 months"
      },
      "location": "Miami, Florida, United States",
      "description": [
        "Liaise with senior producer and artistic Director to execute any production needs.",
        "Created, maintained, and updated the production schedule and worked with all vendors to ensure timely schedule.",
        "Distributed full production schedule and daily call sheets to all crew leads for the month of production.",
        "Supervised and provided all direction to production assistants."
      ],
      "company_url": null
    },
    {
      "company": "Los Angeles Kings",
      "title": "Supervisor",
      "duration": {
        "start_date": "Nov 2016",
        "end_date": "Mar 2020",
        "date_range": "3 years 5 months"
      },
      "location": "Greater Los Angeles Area",
      "description": [
        "Organize and facilitate in-arena production and events and act as a liaison between STAPLES Center and the LA Kings.",
        "Produce and show call all games and ensure promotions are accurately executed.",
        "Produce and direct the on-ice activities and ceremonies.",
        "Write all game scripts in ShoFlo and create/deliver timing sheets to the National Hockey League.",
        "Oversee and Manage the GameDay Operations Crew and Stage Managers including scheduling and event confirmations.",
        "Manage all in-game sponsorship inventory.",
        "Stage manage special events beyond normal game operations: Bob Miller’s retirement ceremony, Festival, and Paint the Ice.",
        "Set up activations related to fan engagement – Fan Fests, Season Ticket Member Events, etc.",
        "Manage Events Department inventory of Gameday and event equipment including props, PA Systems, photo activations, etc."
      ],
      "company_url": null
    },
    {
      "company": "Los Angeles Chargers",
      "title": "Stage Manager and Production Coordinator",
      "duration": {
        "start_date": "Dec 2017",
        "end_date": "Dec 2019",
        "date_range": "2 years 1 month"
      },
      "location": "Greater Los Angeles Area",
      "description": [
        "Management vendors in the fan facing areas.",
        "Coordinate special game appearances of Charger Girls and the Thunderbolts on the field.",
        "Produce Christmas party.",
        "Training Camp production."
      ],
      "company_url": null
    },
    {
      "company": "All Access Staging & Production",
      "title": "Soft Good Department Manager and Inventory Tech",
      "duration": {
        "start_date": "Jun 2015",
        "end_date": "Apr 2018",
        "date_range": "2 years 11 months"
      },
      "location": "Greater Los Angeles Area",
      "description": [
        "Manage and oversee all aspects of the Soft Goods Inventory.",
        "Prep/receive rental orders to be used on various jobs in the entertainment industry.",
        "Track rental inventory of all rental gear including missing and/or sold items.",
        "Facilitate orders/requests between clients, sales representatives, and manufacturers.",
        "Manufacture soft goods with an industrial sewing machine."
      ],
      "company_url": null
    },
    {
      "company": "Freelance",
      "title": "Special Projects - Various",
      "duration": {
        "start_date": "Jun 2016",
        "end_date": "Jun 2016",
        "date_range": "1 month"
      },
      "location": null,
      "description": [
        "Served as a producer, script, writer, stage manager, production manager, on various events and parties for the Special Olympics international (Golisano Awards, Founders Reception, Round Table, other programmed events, and Opening and Closing ceremony)."
      ],
      "company_url": null
    },
    {
      "company": "Lakers Special Events",
      "title": "Associate Producer",
      "duration": {
        "start_date": "Present",
        "end_date": "Present",
        "date_range": "0 years 0 months"
      },
      "location": null,
      "description": [
        "Served as Associate Producer on various events and parties like Kobe Bryant’s statue unveiling, Elgin Baylor statue, Kobe’s Jersey Retirement, and Lakers Friends and Family Holiday Party."
      ],
      "company_url": null
    },
    {
      "company": "BETX Experience",
      "title": "Production Coordinator",
      "duration": {
        "start_date": "Jun 2016",
        "end_date": "Jun 2018",
        "date_range": "2 years 0 months"
      },
      "location": null,
      "description": [
        "Assisted with coordination of overall event constructs and fulfillment of a dual stakeholder event.",
        "Managed load in and strike coordinated taking into consideration all vendor needs and arranged labor through the union.",
        "Acted as a liaison between BET, AEG, and Los Angeles Convention Center.",
        "Managed relationships with vendors, talent, and venue for execution.",
        "Oversaw guest experience aspects of event, related to security, ingress and egress, guest flow, safety, and communications."
      ],
      "company_url": null
    },
    {
      "company": "NBA ALL STAR GAME",
      "title": "Event Organizer",
      "duration": {
        "start_date": "2018",
        "end_date": "2018",
        "date_range": "0 years 0 months"
      },
      "location": null,
      "description": [
        "Organized various aspects with the Turner Broadcasting network live events team.",
        "Managed artist green rooms.",
        "Assisted with talent movement from venue to the stage.",
        "Managed installation of the production elements related to the TBN spaces."
      ],
      "company_url": null
    }
  ]
}