{
  "name": "Joanne Hsu",
  "title": "Senior Brand Marketing Manager",
  "location": "Irvine, California, United States",
  "key_skills": [
    "Digital Marketing",
    "Brand & Product Marketing",
    "Integrated Marketing Communications",
    "Content Marketing",
    "Social Media & CRM Strategy",
    "Product Launches & Business Growth"
  ],
  "contact": {
    "linkedin": "https://www.linkedin.com/in/joannecchsu",
    "email": "cch406@stern.nyu.edu",
    "company_website": "https://www.morinaga.com"
  },
  "certificates": [],
  "experience": [
    {
      "company": "Morinaga America",
      "title": "Senior Brand Marketing Manager",
      "duration": {
        "start_date": "2022-06-01",
        "end_date": "Present",
        "date_range": "2 years 4 months"
      },
      "location": "Irvine, California, United States",
      "description": [
        "Leading Brand Marketing Team and overseeing HI-CHEW brand marketing strategy and activities to grow brand awareness and household penetration.",
        "Overseeing 360-degree brand communication and content across social media, PR, digital advertising, CRM, TV/CTV, sampling, licensing/partnerships, traditional and trade advertising programs, CSR, tradeshows, etc.",
        "Building a powerful short-term and mid-term brand communication strategy to strengthen brand's core message with the target audience and optimize resources through different channels.",
        "Managing multiple agency partners and internal marketing team members to ensure the brand messages are consistent and cohesive across channels.",
        "Guiding new product strategies and opportunities through conducting consumer research, analyzing category trend and sales data.",
        "Managing D2C e-commerce business strategy to seize growth opportunities and optimize business efficiencies.",
        "Overseeing Customer Relations Management to ensure customer satisfaction and constant improvement of complaints handling procedures."
      ],
      "company_url": "https://www.morinaga.com"
    },
    {
      "company": "Lee Kum Kee USA",
      "title": "Strategic Planning Manager",
      "duration": {
        "start_date": "2020-10-01",
        "end_date": "2022-04-30",
        "date_range": "1 year 6 months"
      },
      "location": "Los Angeles, California, United States",
      "description": [
        "Planning, managing and coordinating cross departmental projects to support the Americas zone’s (including the United States, Canada, and Central South America) development and execution of long-term strategies and improvement in sales & operation efficiency.",
        "Leading and managing the New Product Development process and projects.",
        "Developing strategic initiatives and following through action plans for all the key functions and operation units to ensure strategic alignment and synergy and address key business issue.",
        "Overseeing and managing marketing budget across channels in America’s zone to improve efficiency."
      ],
      "company_url": null
    },
    {
      "company": "Eastland Food Corporation",
      "title": "Brand Manager",
      "duration": {
        "start_date": "2017-10-01",
        "end_date": "2020-09-30",
        "date_range": "3 years"
      },
      "location": "Los Angeles, California, United States",
      "description": [
        "Managing numerous food & beverage brands including but not limited to beverage, snacks, coffee, ready-to-eat, and frozen categories.",
        "Building brand equity by developing high-impact integrated marketing strategies using social media, online ads, TV ads, influencer marketing, trade shows, trade promotions, and demo events.",
        "Managing global supplier relationships and collaborating with five nationwide branches to streamline the workflow and maximize business profit."
      ],
      "company_url": null
    },
    {
      "company": "Sweetist",
      "title": "Marketing Manager",
      "duration": {
        "start_date": "2016-06-01",
        "end_date": "2016-08-31",
        "date_range": "2 months"
      },
      "location": "New York, NY",
      "description": [
        "Managed all social media accounts for Sweetist including devising content strategy and developing editorial content calendar.",
        "Created strategic and quality content that ensures consistency with the brand’s voice.",
        "Identified consumer insights using Google Analytics and implementing social listening.",
        "Designed social media analytics reports providing performance track, insights, and recommendations to CEO for improvement."
      ],
      "company_url": null
    },
    {
      "company": "Uzeeum",
      "title": "Marketing Specialist",
      "duration": {
        "start_date": "2016-06-01",
        "end_date": "2016-08-31",
        "date_range": "2 months"
      },
      "location": "New York, NY",
      "description": [
        "Analyzed and improved Uzeeum site’s UI/UX using Google Analytics.",
        "Made recommendations for website feature improvement, content optimization, and functionality enhancement to increase site traffic.",
        "Defined and tracked success metrics and created actionable report and dashboard to support business objectives."
      ],
      "company_url": null
    },
    {
      "company": "O Theater",
      "title": "Marketing Project Manager",
      "duration": {
        "start_date": "2015-03-01",
        "end_date": "2015-07-31",
        "date_range": "4 months"
      },
      "location": "Taipei, Taiwan",
      "description": [
        "Managed a project-based marketing plan to promote the show 'Goodbye, Molly' and boost ticket sales.",
        "Increased public awareness of the show by crafting media pitch and obtaining news reports.",
        "Managed marketing collateral production and enhanced target audience engagement through social media content strategy."
      ],
      "company_url": null
    },
    {
      "company": "Ogilvy",
      "title": "Public Relations Account Manager",
      "duration": {
        "start_date": "2010-12-01",
        "end_date": "2014-12-31",
        "date_range": "4 years"
      },
      "location": "Taipei, Taiwan",
      "description": [
        "Led a team of four specialists to manage a diverse retainer and project-based client portfolio.",
        "Provided PR consulting services for new brand/product launch, branding strategy, crisis management in the form of press conference, media gathering, consumer events, seminar, CSR, media training, and media interview.",
        "Developed strategic communication plans with solid brand messaging frameworks, channel strategies, and implementation plan."
      ],
      "company_url": null
    }
  ]
}